They've broke in through the front lines! I've lost contact with the capital! There's too many of them! Strike back! Finish them! Where is B-127? Bumblebee: Sorry, I'm late. Hit a little traffic. Incoming! Ah....Optimus? Decepticons! After them! Autobots! Fall back! Go back to the tower. Destroy the launch pad. Let none escape! Cybertron has fallen. Get to the escape pods! There are other autobots scaterred across the galaxy. We must reach them, if we hope to survive. Optimus, this is our home, we have to fight for it. We will fight on, but we must find refuge first. I've found a planet that's well hidden. Earth. You will travel there and estabilish a base for us. Once we've gathered the others, we'll join you. You must protect the planet. If the decepticons find it, then our people are truly finished. Now go! Good luck, soldier! I'll buy you some time. Oh! Oh, okay,okay! I'm dead already,man! Oh, it's not just you. You and your men's get your whole squad killed, Danny. - Bravo! - Come'on,man,those things sting. What things? These things? You know, I wouldn't know. I haven't been hit yet. Oh! You know what? That's too close, man. You could've taken out an eye. I got a date tonight, man. This ain't sexy. - You're right. I'm sorry. - Ow! That one wasn't on me. That's a malfunctioning trigger, I th--- This weapon is just faulty! Allright! Just-- Just, stop! Oh, I should've let you die in Greneda. If you did, we wouldn't be able to come to forest. Run around and play these awesome games. Exactly! Oh, I hate you. Come'on, man. That hurts. 'Cause I love you. But, you're refuse to let it in, because you got into --- - A therapist will probably tell you what - Jack,look, man. Danny, I know I was stupid, but... Yo, take cover! Danny? Are you okay? Yeah,man. This is agent Jack Burns. I need a medical up here, now. We were in a training strike in the north-west corner of the training course. Multiple injuries. And will someone please explain to me why you drop napalm on your own guys? Negative. There are no army drills on north-west sector. What the hell hit us, then? In need all of you to fan out and track that thing down! Now! Drive! There! What the hell? Take it down! Get down there now and flush that thing out! Target located, sir. Fire! Damn it! Oh, no! It's going for the mine! Cut it off! Move! Move! Please. This is a mistake. Stay cool. Hold your fire. I don't want to hurt anyone. Who called in the airforce? That's...not the air force. Run! You think you can hide? Now you will die screaming! Like your friends d--- OH! Tell me where your friends are hiding! I will never talk! Blitzwing: Is that right? [His hand turned into a voicebox extractor] Blitzwing: Then let's make it official. Blutzwing: B-127, as a member of the autobot resistance... ...you're a traitor to cybertron. And I hereby sentence you...to death. No! Shut up! Good morning, dad. No! Don't tickle. Oh oh! Caught! Gross, Ron. Excuse me. What--- ? Are those your diving trophies? They're taking too much space,Mom. You're gonna regret doing that. Where is breakfast? Breakfast is conveniently located in the cupboards and fridge. Tried to help out, you know, a little. Well, since I'm a such a big kid now, I can make my own breakfast. You know how I could be even bigger help out here,mom? If I had a car. - Charlie... - Well, do you know? It's my birthday tomorrow. Perfect timing for award a cash gift. You know, 500 bucks is really all I need to finish the corvette. I don't have 500 dollars! You know how much nurses make. Half as much as the doctors for twice the work, right? I tell you what, kiddo. I got a another job interview tomorrow, if all goes well, - I'll have you swim in car parts. - I prefer cash, Ron. Do not be rude. Feed the dog Conan is otis's dog, make him do it. What? Oh! you look so grown up in your karate suit. My baby boy is becoming a man. Oh, shit! I'm gonna be late. Can you drop your brother at karate, on your way at work, please? Ahm..I -- I could, if I had a car. Just let him follow you on your bike so no one abducts him. 'Abducts him'? You just said he's a grown man now. I anyone tries anything, I'll rip through their freaking spleen. - Thanks,Bruh! - Alright! Eat safe. Huh. Excuse me. Hi. We neve actually met--- - Sorry, I can't right now. - No. Yeah...O-- Okay. Hey, awkward girl! Oh, my god! I' m so sorry! Oh, God. Someone's getting fired. If I had to wear that, I would've pray to be fired. You'll get one, Tina. Let's go. Come on. Hi, Uncle Hank. Are you still working on that damn car? Are you still working on that damn personality? - What have you got for me? - Whatever you want. The Russians on the blow us all the hell, anyway. That's the spirit. Hey, kid! hand me the 3/8, would you? - You're working on a carburater? - M-hm. You need the 1/2 inch. I said the 3.... - Thanks,kid! - Yep! Where is Optimus Prime? He survived the fall of the Cybertron. I know a rebel would gladly follow their leader without questioning. So where is he? My name is Cliff-jumper. Leutinent of the autobot ressistance. My sabertron... Wrong answer! We know he is planning to estabilish a base. Tell us where and we'll let you live. My name is Cliffjumper and--- No! That's B-127's signal. - Can you trace it? - I already did. If you don't tell where prime is, Perhaps your young friend will. - Never! - You're a brave warrior. I mean, you deserve a better death. But then again.... No! Set course for earth. I'll give you 30 bucks for all of it. I'll get twice as much for the coil alone. From who? I'm the only one that comes in here. I mean, I don't know how you're still open. Just take it. Go,go. My show is on. Hey, where did you get that beetle? I swear to god, ever since they put up that dumb-ass tower, ...I cant get a signal to watch my shows. I gotta see what happens to ALF this week. Come on! Arg! Are you kidding me? Damn it. I give up. I can't do this without you. Happy Birthday. I miss you, dad. - I think it's too low, honey. - No. - No, I think it's goes to that button. - Yeah? Yeah. I'm--- No. Except-- Hey. - Good morning, birthday girl. - Hi! You look... ..nice. Happy Birthday, baby. I Love you. Come on, Open your present. I'm gonna be late for work. Thanks, Mom. Helmet? With Daffadils. So I keep hearing about people on mopeds getting run over.. ..and their brain smashed in. You gotta wear this from now on. I don't care if it's not the law. It's our law. Plus, look how cute it is. - Yeah. - Happy Birthday. I actually got a little gift to you, charilie. I mean, It's small, but it's from my heart. A smile is a powerful thing. It releases endorphins. It's sense to to the world 'unfun and approchable'. You know, there is a whole chapter in here about how people smile more often actually have more friends. It's unbelieveble. I really think it's gonna change your whole life if you give a smile more often. I want the beetle. - What? - The yellow beetle, I want it. I'll make you a deal. If I get that thing started, its fine. That's no deal. That's just you taking my car. If I can start it, I keep it and-- and I work here every day for a year. I'll scrub the grease off the floors, okay? I'll pick up and organize every scrap of paper in this place. I'll even detail your horrible, disgusting toilets. Please. It's my birthday. Sorry, no deal. 'Cause we ain't hiring. It's yours, kid. Happy birthday. Thank you! Thank you! Thank you! Thank you! And my toilets are gorgeous. God, please. Come on. Oh my--- Oh my God! Oh, my god! Thank you so much! I love you! That thing ain't even safe to drive. It's a death trap. She's happy though. It was amazing. What? Oh my God! Charlie, what was that noise? Nothing! Mom, you should go back to bed! Everything is fine. - What the hell is that? - A...It's--- What is that car doing in our garage? Car? Oh, that car? That's my car. Uncle Hank gave it to me. It runs, yeah. Those aren't safe! I wish you would've told me before you've brought it home. Okay. Sorry. - I'm in the middle of some stuff. - Okay, I'll get out of your hair, but... Tell me things, sometime. I'm your mother. - Okay. - Okay. - Good night. - It really runs? - Yeah, It really...really runs. - Cool. Are you still in there? Okay. I'm little jumpy,I'm sorry. Okay. Hi! God, are you--- Do you speak? I won't hurt you. Can you..understand me? What are you? Where did you come from? Okay, okay. You like my shirt? Are you a metal fan? No..wait.. Oh,who would me? Who am I? Oh, I'm.... ...Charlie Charlie Watson. I'm... eighteen. Today,actually, it's my birthday today. What's your name? You-- You don t know or you don't have a name? You sound like a little bumblebee. I'm gonna call you that from now on. Bumblebee. It matches to your outfit too. I want a divorce, Roy! Come on, Ann! Well, give me one good reason! You tried to sleep with my sister! Unsuccessfully! Yeah! You're unsuccessful at everything! That damn payment was for a house, you bought a car! How stupid are you, Roy? We don't need a car! God! No, just settle down for one second. Just hear me o-- - What the hell is that? - What? God, Roy, that thing is coming right toward us! No, no, no, no. No, no, no,no. Not my car! Not my car! Please, god! No! Not my car! Oh,thank god! My car... Yeah, I'm okay. Oh, that's good,baby. That's good. Ow! Is that my car? Hello--- ? Jesus! Earth. - No! Wait! - Hello! How underwhelming! The indigenous life is even more primitive than I expected. Hey! I liked the way they pop. Focus, comrade. B-127 is distress signal came from the western coast of this continent. For now, we head west. When will they start letting you use nunchucks? I don' t know, but I hope soon. Good morning! See you guys later. Where are you off to so fast? Nowhere. Have a nice day! Good morning, Bum---- Bee? Bee, where are you? God! Oh, god! Oh,god! Bee! Where did you go? Otis! Have you seen my car? Unfortunately,yes No, Otis, have you seen my car today? It was-- It was... in the garage. Someone's stole it! No, idiot, mom took it. Gonna bring Conan to the vet because he's swallowing a rubber glove or something. - And Ron needed the station wagon. - Thanks God. Wait! - Alright. - Excuse me.It's me again. - We've never officially met-- - Yeah,I can't right now. Sorry. No, Yep. Ok-- Okay. I know, buddy, hang in there. You can't eat everything you see. Just let this be a good life lesson for you. Oh god, Bee. Stop it! Don't do that! Bee, no! - Mom! - Ah! Jesus! Charlie, what are you doing? - Mom, you gotta pull over! - What the hell is going on? - Just pull the car over! - Okay, okay. Alright. Would you put that droughnut joke away? What were you thinking? You almost gave me a heart attack. I thought I was being car jacked. I'm taking the dog to the vet. I can't believe you were taking him without me! Mom, I'm so worried about him! He's my dog too, you know. What happened to Conan being Otis's dog? Mom, you're being hysterical, okay? You shouldn't be driving in such an emotional stress. I know how you get during emergancies. I'm a nurse. Not of animals. - Okay. - Oh. Okay. I'm happy for you to drive. You weren't wearing your helmet, by the way, I saw that. Oh, shoot! Keep it together, Bee. Sir! Sir, I thought you would want to see this immediatly. They're sure? Yes,sir. Two of them just made contact in texas. Intel says that they're heading west fast. Saddle up, simmons. We're going to texas. Okay, Bee. We need to go over a few things. Okay, we're all clear. Alright! What do you think of the beach? Oh! I'm-- I'm good. I'm-- No,I'm good thanks. Look, people can be terrible about things they don't understand. If they find you, they will probably lock you up in a lab somewhere... ..and cut you into tiny little pieces. It'll be.... ..bad. Trust me. Only person you can show yourself around is me. Okay? So, let's practice, are you ready? You see anyone besides me, what do you do? Great. perfect. Come back now. Okay, so let's say we're driving, right? We're driving in opposite and---- Oh! shoot! Somebody is there. Hide! Hide,Bee! Hide! Are you serious? Bee, it's too late, you're already dead. It's alright. It's more of a practicing. You'll get it. FOX- 2 on approch. Non-biologicals are inbound. Our goal, sir, should be to communicate with them. First contact with an alien species. I spent my whole life waiting for this moment. If they make one wrong move, we put 'em down. The humans are multiplying. Please let me kill some. Not yet. B-127's signal is gone silent. I have an idea. Listen up, I'm Agent Burns, and this is Dr. Powell. We currently have a hundred guns pointed right at your head. So, state your business. People of earth, we're decepticon peace keepers, patroling the galaxy. Wait.What are you doing? Oh! This is humiliating. We believe a dangeorus criminal from our world is hiding somewhere on yours. How is it that you think we can help? We need your eyes. Wait. You want to access to our satellites? Our scanner's range is limited. Your infrastructure is primitive. But combined, they could be quite powerful. No way! Out of the question. We have a common enemy, agent Burns. There is a war raging on our planet. If B-127 isn't found, that war may find it's way here. Perhaps, we can find a way one and another. We'll talk it over with our superiors. In the meantime... - .. if you could follow us. - Very well, friend Powell. Take us to your leader. It's sucked being couped up in a VW all day, hah? Is there.. anyone can help you? Do you have a family? You know, like a mom, dad, siblings. You all love each other. Or drive each other crazy and you can't wait to get away and start your own life. Do you want me to see if I could fix it? I'll be gentle, I promise. Wow! You lay down, okay? Hold still. I think maybe there is something--- B-127, I pray this message finds you--- our war rages on. planet earth. Survival... Ravage, eject! Your mission -- soldier. Are you okay? Who was that? That voice, he said something about a-- a-- a war Do you remember anything? Is the VW beetle is some kind of disguise? Are you hiding from something? Are you scared? It's broken. It's okay. Now I know that I can help you. Let's go home. And a basket case. And a princess. Right, I'm almost done. Is that answer your question? No way! Are you actually watching it? You can pop-in another one, if you want. Woo-hoo! Come on, sweety! You got this,Charlie girl! Where are you, Charlie girl! Hello, Brighton Falls, this is Charlie Watson.. ..future olympic gold medalist. - That was so perfect. - Thanks, dad. How do you feel? You're amazing--- No! Why would you play this? I-- I'm Sorry, just... I finished. Let's see we got something. Okay. Okay. Alright. Oh, my god! Yes! It worked! How do you know? Man, you got some moves! You know, Bee, music can help us to say our feelings. You're gonna love this. It's brand new. Not a smiths fan? Okay. Ahm... Here. Try this. Fine. Okay,next...Let's see. Well, Joan jett & the Black Hearts... Stones. Hey! Hey, Hey, Please don't touch those. Please. They were belong to my dad. Do you want to hear it? We used to listend to this while we were working on our corvette. This was his favorite. He used to say it would make the car feel better. We used to work on this car every weekend together. It was our thing. That tape.... That was the last time I saw him. He died of a heart attack. And I never really got to say goodbye. You know, I always thought if I could just.... ..finish fixing his car. If I could just give it a start up again... ..he would hear me.. He would hear me. I say this with all due respect. Have you lost your damn mind? - That was with all due respect? - The man's got a point, doctor. Our satellite network is at the forefront of our national defense. Sir, please. It could be a once in a lifetime oppertunity. Can you imagine the advances these creatures might bring? Well. I imagine the advances! An advance on washinton. - New york! And advance on chicago. - It's not gonna happen. They literally call themselves 'dicepticons'. - That dosen't sound like red flag? - Enough! - From both of you. - Sir.. We're talking about the most advanced robotic system ever seen. If we tell them no, they'll just take their technlogy to the russians instead. You really want to go down in history as the man causes the cold war? Fine. We'll help them find their fugutive. And when it's done, you can do all the experiments you want. Hm? Yes,sir. Gentle---- Ah... robots! Welcome to sector seven. How kind of you to finally allow us to in. We're very happy to have you here. - As friends. - Thank you, friend Powell. My superior has agreed to grant you limited access to our satellites. In addition, you're welcome to use all of our technology here. It's the largest super way of crays on earth. We thank you for your hospitality. Tell me, those vocal communication devices you use. - Do they function worldwide? - The telephones? Yes, why? You've gotta pick a station, man. And I know there is lot of choices. You want to go on a date with me, maybe? Okay... - What are you trying to do? - Here we go. Here we go. You're not a nerd.///// Just-- Okay, you're a nerd, but just don't let her know you're a nerd. Excuse me. Sorry to barge at night,I just--- Hah? Ahm! You need to go! No! No, it's fine. Just-- Just sit down,please. Sh..., Just don't scream, okay? What is that? It's ok. Try to just breath. Breath. - First of all, Hi. - Hi. I am Charlie. I'm Memo. Hi. Hi, Memo. Ahm... - It's nice to meet you. - Pleasure to have ---- I know what you saw, it's a little crazy. I can explain. Yeah, I can't explain. But here's the deal. If you told anyone what you just saw, I'm gonna have to run you over with my car. - Jeez! - That was--- No, I don't mean that in a mean way, okay? What I'm saying is no one can know what you just saw. Okay? You promise? - Yeah. - Okay. Bumblebee, you can--- you can come out. - It's a... - He. Wow. He's been going up and down on that dial all day today and I don't know why. Hey, check out he's reflexes. Oh! oh, god! Oh! oh! - Yo, give me your shirt. - Hah? Give me your shirt! You mean the shirt that I'm wearing? Yes,Yes. Come on! I'll give it back to you. Okay. Come on! Give me your shirt! Alright. No! Wait, wait,wait. Hey, no,no. - You-- you don't need to do this. - Yes, I do. - But we're not-- - come here! - I get-- I get it! - Come on! Sorry! I know I promised to you but.. I cant give you that back. It's incredible! They're combining our technologies seamlessly. Satellites, phones, computers. They're creating an inter-connected web of information. Volumes of data at their fingertips. It's revolutionary. He's a weird guy. They're tracking fluctuations in energon levels. It's like a heat signature specific to their species. It's astonishing. It's beautiful--- Hello? Hello? You're giving them our satellites, comms,god knows what else. Yet, In a space of a day they will be giving us enough data not only hunt down B-127 but all of them. Let them finish what they're doing. Let them find B-127. Then I'll give you permission to destroy them all ..for spare parts. Sir! yes,sir. So you' ve no idea where he came from? No idea. Have you thought about calling the cops? What are they gonna do, Emmo? They just gonna send him away to a lab and do weird science experiments on him. Weird science! Plastic tubes and pots and pans! You're getting pretty good with that radio dial, Bee. Dj Bumble in the house! Woo-Hoo! Is that why you're always messing with the dial? You're trying to teach yourself how to talk, aren't you? - No way! - Oh, my god, Bee! You're genius! You're an actual genius! What's going on here? That's trip from sixth period. He said he was busy this week. I mean,you want to get out? - This is pretty cool. - Okay.. Bee, We will be right back. Don't do anything crazy. Hey, everybody, come, watch! Trip's gonna jump! Hey-- what's going on over there? Dude, you're crazy! - Come on! It's not that big of jump. - Is that trip summers? Oh, you know-- you know trip? I mean, yeah. I-I spilled a galon of lemonade on him once. Let's see anyone have the balls to jump off this thing with me. Ah! - Brave volunteer! - I-- I -- see I didn't--- I didn't do that. You've got the touch! You've got the power......! Hey! I know you. Ah...nah! Sorry about that. You were on the dive team with my little sister. I saw you win state couple of years ago. Oh...a...Yeah. Ladies and gentlemen! This has just got whole lot more interesting. We have a championship high diver on our hands. Yeah,I, actually--- I don't-- I don't.... I don't do that anymore. Oh, don't worry, I won't make you go first. Hold on,buddy! Dive girl! Isn't that enough? Dive!Dive! Dive! Dive! Come on! Dive! Dive!Dive!Dive! - Where are you going? - Where're you going, dear? - Are you okay? - Let's just go. - Loser! - I thought you said you were on the diving team! Where are you going, sweety? What happened out there? That was your big moment to let go. What's your damage, tina? - Is that the churros guy? - Where's your hairnet,dude? It's in the garbage,I saw you threw some wear, which you used.. ..for sanitary purposes obviously, but... This car is an embarresment. You should have your dad buy you a better one. Oui! Sorry. - Are you okay? - I'm fine. They are idiots. I think I know something that'd make you feel better. - What? - Revenge! - I don't want revenge. - I do. What about you, Bee? Want some revenge? Revenge! Oh, man! Come on. I've got an idea. This is tina's house. And this is toilet paper. You use it for when you--- Here, just take this. No! No,no,no! You gotta....throw it. Like this. Not bad. - Hm. - Not bad. Yeah,okay, Bee, you will be our eggnap,right? Yeah. I love to have some. - You see these right here? - M-hm. You grab one of these like so. And that right there.. That's your target. - That's right. - Alright? Just do like this. - You think we could just-- - We just maybe teach him at the end. Oh! - Bee, what--- - What-- Oh, my gosh! - Hide! Hide! Hide! - Okay,hide! - Just stay low! - Okay, okay. Okay. Hide, Bee! Go! Go! Go! Mom!!! That was..insane. My heart right now it's going crazy! - Oh my God! - Stop the car,please. No no no! Bee,what are you doing? What are you doing? I can't drive...55! Bumblebee! Stop!! Oh, my god! Oh, my god! We're going to jail! We got an yellow VW car driving it's damnself through the peaco tunnel. Good night. Go-Good night! Good night, Bee! Come on now, buddy I gotta go to work, okay? Bee, listen to me. You need to stay in this garage, okay? After what happened last night, I'm pretty sure the cops will be looking for you. And you don't exactly --- I'll be back. allright? Here. You're taking my pop-tart. I need you to go to the frozen banana stand and steal some sticks. We're out of sticks. Can't we just sell the hot-dogs without the sticks? No. - What's happened here? - We got a hit I think. Where is that location? Near san fransisco. A coastal town named brightonfalls. You have a personal call. - Hello? - Charlie.Charlie. Hey, it's memo. You gotta come home... right...now. It's bad. It's really,really bad. Where is bumblebee? Bumblebee? What've you done? What were you thinking? What--- I told you to hide in the garage! Great! I'm not mad, okay. This is all my fault. I never should have left you. Okay, maybe don't transform all the way. We-- We still gonna get you through the door. Come on, buddy! It's okay. I'am so screwed. - And now you're crippled for the life. - Honey, watch the hair. Go! go! Quiet! Mom, Wait! Oh my God! - Mom? - What happened? Mom, I'm really sorry. This is all my fault. What would you do to my tv? But, mom, I can explain. We will talk about this later, okay? - Right now, I have to go. - Are you kidding me? No! you're not going anywhere. It's about my car, it's really important. It's about your car that you spend all day and night shut in that garage... ..doing god know what? - Mom, I can't. I really can't right now. Oh, no! You really can! Charlie, you really can! I have had it! Your attitude! You're always soaking around. You brought home that piece of crap without even asking me! Every one in this family is trying to be happy! And all you want to do is make things harder! You know,mom, just because you've moved on and you're happy with your new life... ...dosen't mean I have! You found a replacement for my dad and I haven't, okay, I never will. So I'm sorry if that make things harder. But in ten months from now, you won't even have to deal with me. Charlie! Hey, you okay? Yeah. You know, I just feel like ever since my dad died... ..I've become this dream on everyone, and I hate it. You know, it's like everybody expects me to act... ..but nothing ever happen and it's... It's impossible to do that. Ah..about your dad, I'm-- I'm really sorry. Thanks. You know there is-- there is this line that I like. 'The darkest nights produce the brightest stars.' That's nice. Mom got it from weight losers. Huh. Get out and move away from the vehicle. Stay cool, Bee. What's going on? Hey! - Come on! - Stop it! Let go of me! - Weapons, now! Take it down! - Run!! No, don't run! Do not run! And she ran. Please tell me they are on our side. No more running! No more Hiding! B-127, you are a traitor and a coward! Tell us where Optimus Prime is hiding! Bee, lookout! Why isn't he fighting back? Why aren't you fight? Leave him alone! Please! Again! Hit it again! Stop! Stop it! Your daughter stole government property,Mrs.watson. She's been having troubles, but... ..we had no idea it was this serious. I--- Charlie..honey.. Look, I didn't steal anything and he dosen't belong to them. - He? - Ma'am.. I can assure you that it isn't it. And it is a highly dangeorus war machine. No! He isn't, okay, Mom? He's not some war machine! I-- I don't know what he is, but he's my friend. Ma'am, your daughter's had a traumatic expirience today. Maybe misunderstand everything she's seen. Just disoriented. No! I'm fine, Mom. I'm completly fine. Okay? you have to believe me! Please! I didn't steal anything. Stop! Just go to your room! You know, when I was going through puberty, I stole things too. - I stole box of Mallomars once. - Yeah, we know. Boom! Gotcha! Oh, Mom's gonna love this. Alright, Otis, look, you just need to go home. - Mom! - No,Otis! Stop it! Why would you do that? Let go of me! You're touching my--- I'll tell you a secret, if you shut up. Okay, so, this is my room. You should make yourself home. These are actually,like, my sister's stuff. She likes playing pranks,like, putting her stuff over here. - Can I sit down? - Ye-Yeah! Yeah! Residants of Brighton Falls have been witnessed to an unusual sight this evening. Armed forces pouring in to town.. ..as a part of what we were told, is a routine military exersice, setting up camp at our own mackinon air base. If bumblebee still alive, that's where they keeping him. We have to go, We have to try and safe him. Count me in. I'll take point. No, you won't. - Come on! - No, Otis. - But I can help. Master --- - Look, I need someone here. I need someone reliable to make sure that mom and Ron don't know that I'm gone. I am someone reliable. Hell, yeah! You're. Good luck. You too. Get over here. Let's do this. Tell us where optimus prime and the rebels are hiding.. ..and we can end this war. - Talk! - Who is this... ...Optimus prime? It's not your concern, Human Powell. Last chance. Are you sure this is a good idea? It's a terrible idea, but I gotta try it. Wait, No! That stuff--- - How did you know the power was off? - I didn't. Let's go. - Can I? - His memory cells are fried. Finish him. We will fight on... ...regroup,rebuild and retake our home. But we must find refuge first. You will travel to earth. Once we've gathered the others, we will join you. You must protect the planet. If the decepticons find it, then our people are truly finished. Stay safe, soldier. I am coming. Prime is coming here? They're all coming here. This is our chance to wipe out the autobot ressistance for good. We'll burn down the whole planet to cinders. We must get word to Cybertron immediatly. - This is Burns. - Tell them to bring an army. - Burns, we've made a terrible mistake. - Powell? And thanks to our human allies... ..I know just how to get the message home. They're using our satellites, they're call in an army. They're gonna kill us all. Thank you for your hospitality,friend Powell. He's all yours. - No! - Powell? - You have to stop them. - Powell! Powell! - Where's the Krazy glue? - What? Did you Cut the wire to the TV? Ron! Oh! Charlie! Charlie! Nice! The reel-to-reel still works. Where is your sister? Charlie has fallen ill and must stay in her bedroom for the rest of the evening. She wishes not to be troubled. Keep clear of her chambers. What? Charlie has fallen ill and must stay in her bedroom for the rest of the evening. She wishes not to--- Otis, are you on drugs? Hm? No no! Mom, mom. please! Stop! Stop! - Charlie? - Mom, there is no reason to go--- - Mom! Mom, stop! - Otis! Where is she? - She-- - Otis! I've found a tower to transmit our message. It's close. B-127, I almost forgot. I didn't. No, don't shoot! Bee! Bee? Talk to me, Bee! talk to me. Oh--- I can fix this. I can fix this. - Charlie... - You have gotta wake up, Bee! You gotta wake up! Please! Charlie, we gotta go. Charlie... - The gun! - What? The electric gun. Get it. I can fix you. Oh, come on, Bee. Come back to me. Come on, give me the other one! Wake up! Please! Please, Bee! I'm sorry. Oh my God! Come on, Bee, we're gonna get you out of here. Charlie! There is, like, a million guys out there. We gotta move now! Come on, Bee! You gotta get up. Can you get up? - There is a door in my way! - Move! Move!Move! They've got bombs! We gotta go! Bee, come on! - Charlie? - You've gotta get up. Come on. - Three! - Charlie! - Come on! - Two! - Come on! - One! Charlie! Memo. Memo? Memo, wake up. Easy. Easy. Hold your fire. Get the kids out of here. Memo, wake up! Memo? - Come on, kid. - Hey, No! Bee! Run! Bee! No! Run! Let go of me! We need to get away from that thing! - Take it Down! - No! Stop! No! Stop it! Contain it! Dismantle it! Strip it down to parts! Leave him alone! You don't understand! I beg you! Please! Kid, Stop! It's a machine! He is more human than you'll ever be! That is enough! Oh! Shit! Oh, no! Get down! Fall back! Take cover! Bee! Bee! Bee, stop! You remember, don't you? They're coming back. Oh,god. Are you okay? Yeah. Yeah I'm fine. We-- We need to get out of here. We gotta get you some place safe. Bee, if you stop, they will kill you. If the Decepticons find Earth, then our people are truly finished. Okay. Then we fight. Let's go. Get in. I'll go and buy sometime with these guys. Did you just kiss me? - On the cheek. - Still counts. Still counts. Halt! Sto--- Stop! Well, that didn't work. Faster, Bee! Faster! We should really look into getting seat belts. Oh, my god! Oh, my god! It's okay. She's gonna steal her robot back, fight out the police... kill two bigger robots and come right back to us. Shut up, Otis! It appears to be a high speed chase underway, just outside mackinon air base. Go right! Go right! Closer! Closer! If you lose that car, I'll personally rip your face off. - Oh my God! - Now all under control. Charlie! You pull back car over right this second! This is very unsafe what you're doing! Mom, You've gotta get out of here, okay? Mom! You have to trust me, Please! Charlie! We have gotta help her, Ron! Hang on! Oh no! Please! - Get out of the way! - Oh, my gosh! - What are you doing? - I saw this on the 'Miami Vice'! Yah! - I got it! I got it! - No! I got it! Nice driving, Ron. Is everyone okay? Ron! We have a kid in the car! I was trying to save the other kid! What was it--- Otis? Otis, are you alright? That was...radical. I am preparing satellites to transmit our message. Okay, what's the plan? This is your plan? I hate this plan. Bee, I want to help. I would hate Anything to happen to her You're actually talking. And you're listening to The Smiths! Be careful. Go! And finish the job this time! Oh, shit! How the hell I'm gonna I get up there? There! The one on the tower! Are you think these little chains can hold--- ? Hold on! What are you doing?! Come on! Come on! No! After I kill you, I kill her! Bee, no! Ha-Ha! You missed. You will kill us both! Bumblebee! You! You need to get out of here. What do you mean? I mean, my friends are coming. They're gonna be looking for him. Thank you. Thank you. Hey, soldier! I'm here. I made it. What's going on? The world is already been saved, kid. Cool. Cool. What If my mom called? This is it,Bee. Let's go! Bee, I can t go with you. You've got people out there that need you. And so do I. I hate to let you go. Thank you! -- So much. For giving me my voice. Thank you for.... ..making me feel like me again. I will never forget you. Goodbye,Bumblebee! No way! Are you kidding me? Are you telling me you could have been a camaro this whole time? Oh, my god! Don't you... Don't you forget about me.. Don't, don't,don't, don't.... Dont you forget about me... There you go, Ma'am. Baby! Thank god you're alright. Thanks for coming, Mom. That was some driving, Ron. Well, I'm taking a few notes. Otis. They forced me to tell.. I'm glad they did. I couldn't have done it without you guys. Hey, Charlie! Oh! I'll be right back, okay? Wow. What happened to you today? Oh, this? Oh, you know, robot fights.. ..speed chases, international disasters. The usual. - Great. - Yeah. Oh! Ahm. Yeah.. - No, we're not there yet. - No.Yep.Okay,okay. SUBZLK 2019 Jan Old friend. You've kept this planet safe. Because of you we have a future, B-127. My...Name...Is...Bumblebee. Let's see if we've got something. Oh, my god! Yes!