export const Witchers = [
  {
    "name": "THE WITCHERS",
    "chapters": [
      {
        "head": "S01 EP-8: Much More",
        "body": "[rumbling] [Geralt] I will take her, protect her, and bring her back unharmed, I promise you that. [horse nickers] [grunts] [Roach whinnies] Ill winds follow grave robbers. If I was a robber, I'd be taking their belongings, Butcher. If I was a butcher, you'd be amongst the corpses. I was goin' home to my family when I came upon these poor souls. Cintran refugees. Dead at least a week. Now they're a feast for the crows. They're not crows. [flies buzzing] - [man] Wolves? - No. With the hands of two, I could move quicker. The only thing you should do quickly is flee. [grunts] [Geralt] Come on, Roach, back to Kaer Morhen. [man] Don't leave! Look at these people. Innocent people, killed for what? So Nilfgaard can have more land? [grunts] We owe it to 'em to do better. I'm not better. [grunts] [sighs] [hissing] [yelling] [screaming] - [sword slashes] - [creature snarls] [panting] Go home. I can help. - One bite will kill you. - Or you. Go... home! All right... [grunting] [flies buzzing] [exhales] [buzzing intensifies] [screeching and growling] [rumbling] [snarling] [snarls] [snarling] [panting] [grunts] Fuck. [grunts] [groans] [sighs] Not a happy ever after, after all. A fitting end... huh, Roach? [woman] Come on, girl. Get up now. [flies buzzing] [Ciri shuddering] Let's get you out of here. What happened? They came for me. [woman] Well, then... they got what they deserved. You're safe now. It's okay. It's okay. Let me take you home, girl. Something's in the air. [upbeat music playing] [Yennefer] There are, what, 60 of us? And we're the saviors of the Continent? Well, the good news is there's only one way to move north: through Sodden Hill. We must get to the Elven keep that guards it before Nilfgaard does. When is that? My sources say the general's moving troops to the Yaruga Valley. They're two days away. If we cut them off at the choke hold, we can still stop the Empire's progress. We have sent word to the Northern Kingdoms. Temeria and Kaedwen will join us to defend their lands. When is that? Within two days. Hopefully. We will fortify the keep until they arrive. That's the strategy. A military strategy. We're mages. Damn powerful ones. [men shouting in distance] Does Nilfgaard really believe they can take the whole Continent? They've been collecting soldiers, occupying territories... letting loose their beliefs like an epidemic. Istredd was telling me. You saw Is? I saw it first hand in Nazair. Nilfgaard take people down to their worst, then give them something to cling to. Even if it's shitty ale. That's why we're here. Because sometimes it's not shitty ale. Sometimes it's a bed in a pigpen. You have to make a choice to fight back. If Nilfgaard wanted to take the North, why would they expose themselves by sacking Cintra first? Why wouldn't they just push through Sodden and surprise everyone? First, she shuns the military, now she's a military expert. First, he speaks to her as though she's not there, - and then he loses a limb. - [chuckles] You're a talented mage. An asset, to be sure. Despite being a... An inconvenient arsehole? I couldn't have said it better myself. Why did you come? [Yennefer] We've been walking for hours and you still haven't answered my question. [Vilgefortz] If my military experience has taught me anything, it's that the bigger picture's left for history, which makes our task very clear: hold Sodden, save the Continent. Are you in? Is this what we're protecting? [Tissaia] For hundreds of years, this keep has guarded the narrowest parts of the Yaruga River. Now it's the only thing standing between Nilfgaard and the North. [man] These people, they have been pushed here from their homes. They've seen the scorched earth, the fields of corpses stretching between Gemmera and this river. Such cruelty. It's Nilfgaard's way. There's nothing like a higher purpose to permit men to do the unspeakable. [man] But it's all any of us have left. - We have to defend it. - That's heroic. And stupid. Take the children and hide before they get here. There is no more hiding from Nilfgaard. They have come from beyond the mountains to destroy the world. You still believe it can be saved? I suppose I do. With some help. [people clamoring] [chanting in Elder] [continues chanting] [troops marching] [horses neighing] [indistinct chatter] [melancholy tune playing on rebec] [man] One here, on the east gate. Is this all we have? Aye. I'm afraid so. We tried to get more fletchin', but... Nilfgaard's blocked the roads, taken everythin' from us. Nothin' left to do but wait for 'em to attack. [sighs] [Yennefer] You could be down there, with the others. [woman] No. I can't. I lost my farm not a sennight ago... to soldiers who... claimed it belonged to them. Took all me sucklin's, the bastards. I raised 'em, all on me own after me husband died. But now I have to fight back. [whooshing] [rustling] I wish I could do that. It's magic. It's not real. [indistinct chatter and laughing] [baby crying] Is Vilgefortz to be our new daddy? You did time in Temeria. Do you believe King Foltest will bring the Northern armies? [Triss] I know he will. His daughter was cursed. A striga. I guess I was the only one who didn't see her as a lost cause. You saved her? Well, we did. I enlisted a witcher. Geralt of Rivia. I often wonder where fate took him. Somewhere unpleasant, I'm sure. You should be wary of his kind. They're so often disappointing. [Tissaia] The ale won't disappoint. We should enjoy it while we can. It's the first thing Nilfgaard will destroy. Must you always be so fatalistic? It's only appropriate, seeing as we might die. All the more reason to live tonight. Mmm. Like you. [both chuckle] So, are you ready? To die? Yes. I've lived two or three lifetimes already. But you haven't been satisfied in any of them. I've tried. But I've no legacy to leave behind. No family. It's time to accept that life has no more to give. You still have so much left to give. - [horses neighing] - [weapons clattering] [men shouting] Fifty thousand of our soldiers are marching from Cintra, sir. [Cahir] I know. We wipe out the keep, and when the General's forces arrive, they push through to the North. [Cahir] And if it's too late? Fringilla, tell him he cannot possibly take Temeria alone. [Cahir] Tell him he cannot possibly understand the stakes at play. The Brotherhood... they're here. Our scouts just spotted them, fortifying the keep. We must move. How many? We don't know. [field marshal] We must wait. It is one thing to destroy a few peasant insurgents, but we cannot combat unknown magic. We have magic too. Without rules or restrictions. I will personally deplete them until they are empty... and powerless. Cahir, if the report from the trading post is true, Cirilla may already be across the Yaruga. This... is our chance... to honor the White Flame. [field marshal] Sir, forget Princess Cirilla. With the General, we can take the Continent. [Cahir] Enough! We will not lose her. Test the Brotherhood's defenses. [boy] Where did you come from, anyway? You tryin' to outrun the war like the rest of them? [scoffs] Refugees have been headin' this way for weeks now. Mum's a bleedin' heart, takin' you in. Are you dumb or somethin'? Why don't you talk? Ow. Can't you see she's been through hell? She's not here to take chores off your lazy hands. If you stay, think you could teach him some manners? [chuckles] [distant rumbling] [woman gasps] [horse whinnies] [boy] Nilfgaard. [sighs] They're here. [low thumping] [wind whistling] [men shouting] [rumbling] [screeching] [rumbling] [people screaming] [grunts] Again. [rustling] [crackling] [Yennefer] Get up! Everyone up! [people clamoring] [Yennefer] Move! [crackling] [rumbling] [air whooshing] [low rumbling] [Fringilla] Draw the mages out. We will not lose to them. [exhales] [crows cawing] [Vilgefortz] Stay low. We don't know what other tricks they may have. [Triss] Maybe it's over. No, Fringilla's just getting started. [Sabrina] It hasn't been two days yet. How is Nilfgaard's army here already? Doesn't matter. We can't wait for the Northern Kingdoms. - We have to fight. - There are only 22 of us now. Those cowards fled after tonight's attack, but I'm not goin' anywhere. I've lived enough. [wind whooshing] They're coming. We must move. The ten of you, to the field. Go! Sabrina, you take the villagers to the artillery room. Triss, come with me. - [Sabrina] This way! Follow me! - [man] Clear the battlement! - Keep watch on the tower. - The tower? Reserve your chaos. [horse neighing] [man] I don't like the look of this mist, Butcher. It's not natural. [distorted screeching] - [man] Hey, careful now. - [grunts] Easy does it. [whooshing] You got bit, Butcher. You're delirious, but you're not dead. [snarls echoing] Not on my watch! Hey, come on now, be still, I said. We're goin' to my farm. Just as soon as these poor old horses can take us there. You must stay awake, though. Butcher, you hear me? Don't you go to sleep now, whatever you do! [boy] Ma? Ma? Ma? [growling] Back, you beast. I'll kill you and take your treasure. Do not fear, Princess. [woman] Dinner time. [boy] Someday I'll make you a necklace of dragon teeth. The prettiest necklace ever. [woman] No. We must live and let live. What's that mean? - [woman] It's our code. - [man] Hey, Butcher. [woman] We have to cling to something. If we don't, the world descends into chaos. [Geralt] Ma... [low growl] [Borch] It's magic. It's not real. [man] Grab your bows. Keep your head down. [man 2] Ready yourselves! - Let's do this. - Right. [man] Bar the gate! [Sabrina] Let's do this! [woman] Come on, everyone! [wind whistling] [indistinct whispering] [army marching] [marching echoing] Can anyone hear me? [Yennefer] Can anyone hear me? Can anyone hear me? Tissaia? [Tissaia] I can. They're closing in. [wind whistling] [Tissaia] It's time. [sighs] [chanting in Elder] [continues chanting] [continues chanting] [squelching] [coughing and retching] It's working. Coral, soldiers, straight ahead. And they're moving fast. [army yelling] - [crunching] - [screaming] [horse snorting] [Yennefer] Sabrina, prepare your shot. [echoing] Hold your fire until they're in range. Hold! Hold! Now! Pull! [whistling] [bottle whirring] [yelling] - [crackling] - [screaming] Who's next? [field marshal] So much for depleting them. What now? Move to the other front. Right turn! March! [field marshal shouts indistinctly] Vilgefortz, now! [metallic ringing] [sword ringing] [breathes heavily] [Yennefer] Vilgefortz... slow... down. Reserve your chaos. [rings] Huh. Vilgefortz! [pants] What are you after? What do you want? To get to the center of it all. [pants] [Vilgefortz yells] [sighs deeply] [crows cawing] [Fringilla] Break! Break. [echoing] Break, break... [whooshing] [man] They're comin' in! [man 2] Get back in! [woman] Move out! [wind whooshing] They've breached the gate! [rumbling] [whooshing] Shit! Take cover! Fire. [woman yells] No! [people screaming] [woman screams] Oh, no! [echoing] Tissaia. Can you hear me? Nilfgaard has broken through! [wind whooshing] [rumbling] [wind whistling] [Yennefer echoing] Tissaia. We must stop Fringilla. [echos] Fringilla... It's not too late. I did tell you to stay out of this. - You can come back. - [scoffs] - I can help you. - [laughs] Do you know how Nilfgaard took Cintra? Horrible storm. Fifty Skelligen ships sunk to the bottom of the sea, wrecked in that horrible fog. That was you. I won't let you do this. You're worth more than Nilfgaard can ever give you. [sighing] [gasps] - [whimpers] - Dimeritium. [gasps and wheezes] I don't need your help... anymore... - Rectoress. - [Tissaia groans] [Tissaia gasps] [speaks Elder] [chittering] [horse neighs] Hey, don't you move. Butcher, hey! Whoa, lads. Whoa. [rumbling] [Geralt groans] What's that? [explosions in distance] Well, from the direction, I would say that Nilfgaard has made it to Sodden. Shit, look. Take Sodden, you take the North, some say. - Ye gods, that looks hideous. - [Geralt groaning] [groans and grunts] [sighs] Fuck. My bag. - My bag! - This? Here. [groans] [groans] [hissing] [groaning loudly] You need a healer. [Geralt pants] Take me to the Blue Mountains. That's the other side of Sodden. It's impossible, you'll die. He'll... save me. Who? Who? Ah, hey! - Wake up! Hey, wake up! - [grunting] - You stay awake, you bastard! - [sighs] I need... to go home. [boy] What's at the edge of the world? If we go past it, do we fall off the world? Where do we fall? Into another sphere? How many spheres are there? [man] We're going to my farm. - Do you have any food? - Hey, hey, hey. Be still, I said. [boy] Is there food on other spheres? [boy laughs] And after the edge of the world, let's go to Lyria and Rivia and Vengerberg! - [mother] Stop. - And never stop. - [mother] I have to stop. - [man] Whoa, lads. Whoa. - Are you okay, Ma? - [mother] I need water. Go! Fetch it for me. - Ma? Ma! - [Geralt] Ma! Ma! [boy] Visenna? [man] Geralt, I've been waiting for you. - [Geralt] Vesemir. - [young Geralt] Ma! [Geralt] Vesemir. [Yennefer echoing] Nilfgaard is gaining on us. Get back to the keep if you can! Coral, take the path back to us, do not stop. [man yells] Get out of the way! [man yelling] - [screaming] - [Yennefer] No! Atlan! Coral! Save yourself! [whooshing] - [deep sighing] - No! [screams] [sobs] Triss! The gate! Can you buy us time? [Triss] I don't know if I can! I'll find Tissaia and get us help. [Triss breathes heavily] [rumbling] [yelling] - [grunts] - [yells] [soldier yells] Do not stop, Triss. - [horse neighs] - [men yelling] [indistinct whispering] [soldier] Get through that gate! [screams] - [soldier] Get in! - [screaming] [soldier yells in pain] [screaming] [woman] Come on, lads! Come on! Here! Move, move! Quick, quick! [Yennefer echoing] Tissaia, where are you? - Shouldn't you be at... - [yells] [Yennefer grunts] [chittering] [chittering] [people screaming] [screaming] [yells] - [high-pitched ringing] - [Yennefer panting] [grunts] Sabrina. [wheezes] Sabrina... [breathes shakily] - [Sabrina] I'm sorry. - Don't worry. I'll find Tissaia. [groans] [grunts] [woman wailing] No! [wailing continues] [Yennefer] Can anyone hear me? Is anyone out there? [gasping] [Yennefer] If you can hear me, you need to get to the front line. More Nilfgaardians are coming to the woods. We can't give up. We can still fight. [whooshing] [sighs] [Fringilla] You don't need to fight anymore. You have never stopped searching. For what? It's here. With Nilfgaard. [echo] Nilfgaard... In Nilfgaard, there are no limits. Only power and potential. That could be your legacy. [Yennefer softly] Is anyone out there? Is anyone still alive? Is anyone still alive? [birds chirping] [gasps] [grunts] [wheezing softly] [breathlessly] Vilge... Vilge... Help... me. Vilgefor... [squelches] [crunching] [Yennefer] Vilgefortz, are you with us? [sighs] [Yennefer echoing] Tissaia? Tissaia... I need you. [gasps] [groans] [grunts and groans] [sighs] [gasping] [woman] You're not dead. You've merely woken. Tastes like juniper with... Burdock, yes. Gangrene was setting in. I needed to neutralize the toxins. Don't move. There's... magic... in the air. [echoing] Your wound was troublesome, Geralt. But you will be all right. [sighs] You know my name. You're in my head. You're listening. I'm a sorceress. But you knew that already. You were saved by your pulse. Four times slower than a normal man's. I'm a witcher. But you knew that already too. Thank you. Thank you for saving me. Most mages are occupied at the battle raging in Sodden, but I heard a merchant's cry for help and... it's my profession. The only thing I've ever been good at. I'm glad our paths crossed, then. [woman] People linked by destiny will always find each other. People linked by destiny will always find each other. Ma? [woman] Don't move. Come closer. I want you to look at me. How do you like my eyes? Do you know, Visenna, what they do to a witcher to improve his eyes? - Stop it. - Do you know that it doesn't always work? Stop it, Geralt. You don't get to use that name. Vesemir gave me that name. I need to know why. [Visenna] No answer will give you what you want. [Geralt] Three... out of ten boys survive the trial. Tell me... at least... you didn't know this before you left me on his doorstep? It's time to sleep. There's valerian in the medicines. [sighs] You trusted destiny rather than trying to find me yourself. - Don't ask any more questions. - [Geralt] Why? [Visenna] The answers will only hurt us both. It's time to move on, Geralt. It's time for you to find what you let go of. [breathing heavily] [softly] Find her. [echos] Find her... I was just a dream. [Geralt] Please don't go. Sleep, Sir Geralt. Visenna! [Visenna] Find her! No! [gasps] Where'd she go? The woman. [chuckles] Which one? You called out for so many. [grunts] How far from your home to the battlefield? - Huh? - [grunts] To Sodden? How far? [grunts] Well, it's an hour with a swift enough horse. You know, I'm, uh... You know, I'm just a simple merchant. I can't repay you for saving my life. But what I can offer you... is the Law of Surprise. That which I have but don't know. Just give me an ale and consider your debt paid. Now, can we go? [soldiers yelling] [Yennefer] You're alive! Yennefer. Sabrina needs your help. - [explosion] - We all do. [whimpers] - [groans] - No. No! The Northern Kingdoms are close. We can't give up. [explosions in distance] [sobs] You... You saved me. I won't ever forget that. It's your turn... to save these people, this Continent. This... is your legacy. - [sobs] How? I can't! - You can! Everything you have ever felt, everything you've buried... Mm... [softly] Forget the bottle. Let your chaos explode. [sobs] [girl] Where you going, poppy girl? - We can teach you. - [father] She's no daughter of mine. [Glacella] Just because you fucked up doesn't mean we will. [Queen Kalis] You horrible, useless bitch! [Artorius] If only Yennefer had gone to Nilfgaard. [Istredd] I'm sorry you chose power. [whooshing] [Tissaia] Do you actually have what it takes? [whooshing] [screaming] [screaming] [screaming] [army marching] [horses neighing] [distant explosions] [woman] It's going to be okay, girl. [distant explosions continue] [woman] The battle's close, but Nilfgaard's trying to go north. They've no reason to come here. I know. It's a simple life. But if I've gone tomorrow, I had everything I wanted: my health, a roof over my head, a headstrong boy, his father to match. Everything. Except a daughter. I can't help but think... I was meant to find you. Sleep, girl. Sleep. We'll all be better in the morning. [wind whooshing] [sighs] [wind whistling] Yennefer? [yells] Yennefer! Yennefer! - Yennefer! - Yennefer! Yennefer! - Yennefer! - [Geralt] Yennefer! - Yennefer! - Yennefer! Yennefer! [Tissaia echoing] Yennefer! [Geralt echoing] Yennefer! Yennefer! [whooshing] [Calanthe] Go. Find Geralt of Rivia. He is your destiny. [horse whinnies] [man] Whoa, lads. Whoa, now. [woman] Yurga. Are you all right? - We're okay. - [Yurga grunts] Is Nadbor safe? [woman] We're all okay. The war is close, but we're okay. I need to tell you something. - Me too. - I met a girl. An orphan, I found her in the woods nearby. [Renfri] The girl in the woods will be with you always. She is your destiny. [Yurga] I met a witcher. He saved my life. Now, fetch him an ale before he goes to Sodden. Hey, Butcher. Butcher! Where are you goin'? People linked by destiny will always find each other. Who is Yennefer? ♪ The call of the White Wolf ♪ ♪ Is loudest at the dawn ♪ ♪ The call of a stone heart ♪ ♪ Is broken and alone ♪ ♪ Born of Kaer Morhen ♪ ♪ Born of no love ♪ ♪ The song of the White Wolf ♪ ♪ Is cold as driven snow ♪ ♪ Bear not your eyes upon him ♪ ♪ Lest steel or silver draw ♪ ♪ Lay not your breast against him ♪ ♪ Or lips to ease his roar ♪ ♪ Cast not your eyes upon him ♪ ♪ Lest he kiss you with his sword ♪ ♪ Lay not your heart against him ♪ ♪ Or your lips to ease his roar ♪ ♪ For the song ♪ ♪ Of the White Wolf ♪ ♪ We'll always sing ♪ ♪ Alone ♪"
      }
    ]
  }
]